### SQL Strings

In [2]:
import pandas as pd 
import sqlite3


#### LENGTH

```SQL
-- world.db

SELECT LENGTH('string');
SELECT Name, LENGTH(Name) AS Len FROM City ORDER BY Len DESC;
```

In [8]:
con = sqlite3.connect("data/world.db")
pd.read_sql_query("SELECT LENGTH('string')", con)

   LENGTH('string')
0                 6

In [9]:
pd.read_sql_query("SELECT Name, LENGTH(Name) AS Len FROM City ORDER BY Len DESC;", con).head()

                                Name  Len
0  Luxembourg [Luxemburg/Lëtzebuerg]   33
1     San Fernando del Valle de Cata   30
2     Santo Domingo de los Colorados   30
3     Castellón de la Plana [Castell   30
4     Thiruvananthapuram (Trivandrum   30

#### SUBSTR

```SQL
-- album.db

SELECT SUBSTR('this string', 6);
SELECT SUBSTR('this string', 6, 3);
SELECT released,
    SUBSTR(released, 1, 4) AS year,
    SUBSTR(released, 6, 2) AS month,
    SUBSTR(released, 9, 2) AS day
  FROM album
  ORDER BY released;
```

In [24]:
con = sqlite3.connect("data/album.db")
pd.read_sql_query('''
SELECT released,
    SUBSTR(released, 1, 4) AS year,
    SUBSTR(released, 6, 2) AS month,
    SUBSTR(released, 9, 2) AS day
  FROM album
  ORDER BY released;
''', con)

     released  year month day
0  1959-08-17  1959    08  17
1  1965-12-03  1965    12  03
2  1971-05-00  1971    05  00
3  1972-01-00  1972    01  00
4  1973-03-00  1973    03  00
5  1974-04-22  1974    04  22
6  2008-07-08  2008    07  08

In [25]:
pd.read_sql_query("SELECT SUBSTR('this string', 6);",con)

  SUBSTR('this string', 6)
0                   string

In [26]:
pd.read_sql_query("SELECT SUBSTR('this string', 6, 3);", con)

  SUBSTR('this string', 6, 3)
0                         str

####  TRIM

```SQL
SELECT TRIM('   string   ');
SELECT LTRIM('   string   ');
SELECT RTRIM('   string   ');
SELECT TRIM('...string...', '.');

```

#### UPPER/LOWER

```SQL
-- world.db

SELECT 'StRiNg' = 'string';

SELECT LOWER('StRiNg') = LOWER('string');

SELECT UPPER('StRiNg') = UPPER('string');

SELECT UPPER(Name) FROM City ORDER BY Name;

SELECT LOWER(Name) FROM City ORDER BY Name;
```